In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame([[1,2,3,4],[5,6,7,8],[9,8,7,6],[5,4,3,2],[1,4,7,9]],columns=['A1','B1','C1','D1'])

In [3]:
df

   A1  B1  C1  D1
0   1   2   3   4
1   5   6   7   8
2   9   8   7   6
3   5   4   3   2
4   1   4   7   9

In [4]:
df.to_csv('export.csv')

In [5]:
df.to_csv('export.csv',index=False)

# Data Frame Merging

In [12]:
df1 = pd.DataFrame([[5,6,7],[4,3,2],[4,7,9]],columns=['A','B','C'])

In [13]:
df1

   A  B  C
0  5  6  7
1  4  3  2
2  4  7  9

In [14]:
df2 = pd.DataFrame([[1,3,4],[9,8,6],[5,4,2]],columns=['X','Y','Z'])

In [15]:
df2

   X  Y  Z
0  1  3  4
1  9  8  6
2  5  4  2

In [16]:
df3 = pd.merge(df1,df2, right_on='Y',left_on='B')

In [17]:
df3

   A  B  C  X  Y  Z
0  4  3  2  1  3  4